In [2]:
import pandas as pd
import numpy as np

### Seris

#### A One dimentional array like structure with indices as label

In [3]:
s1 = pd.Series([10, 20, 30, 40])
print(s1)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
print(s1[0]) # Accessing first element

10

In [5]:
print(s1[0:3]) # Slicing first three elements

0    10
1    20
2    30
dtype: int64

In [6]:
print(s1[0::2]) # Slicing with step size 2

0    10
2    30
dtype: int64

## Dataframe

#### A Multi dimentional (2D) Array like structure along with indices as label

In [7]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [8]:
df = pd.DataFrame({
    'Name': ['Shivani', 'Krish', 'Manav', 'Aarav'],
    'Age': [25, 30, 35, 40],
    'Marks': [85, 90, 95, 80]
})

df

      Name  Age  Marks
0  Shivani   25     85
1    Krish   30     90
2    Manav   35     95
3    Aarav   40     80

In [9]:
df["Name"]

0    Shivani
1      Krish
2      Manav
3      Aarav
Name: Name, dtype: object

In [10]:
df[["Name" , "Marks"]]

      Name  Marks
0  Shivani     85
1    Krish     90
2    Manav     95
3    Aarav     80

In [11]:
df["Name"][0]

'Shivani'

In [12]:
df

      Name  Age  Marks
0  Shivani   25     85
1    Krish   30     90
2    Manav   35     95
3    Aarav   40     80

In [14]:
df["city"] = ["Delhi", "Mumbai", "Chennai", "Kolkata"]
print(df)

      Name  Age  Marks     city
0  Shivani   25     85    Delhi
1    Krish   30     90   Mumbai
2    Manav   35     95  Chennai
3    Aarav   40     80  Kolkata

In [17]:
df["Age"].dtypes

dtype('int64')

In [18]:
df.dtypes

Name     object
Age       int64
Marks     int64
city     object
dtype: object

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
type(s1)

pandas.core.series.Series

In [22]:
df["Marks"]

0    85
1    90
2    95
3    80
Name: Marks, dtype: int64

In [23]:
df["Marks"] + 2

0    87
1    92
2    97
3    82
Name: Marks, dtype: int64

In [24]:
df["Marks"] - 2

0    83
1    88
2    93
3    78
Name: Marks, dtype: int64

In [25]:
df["Marks"] * 2

0    170
1    180
2    190
3    160
Name: Marks, dtype: int64

In [26]:
df["Marks"] / 2

0    42.5
1    45.0
2    47.5
3    40.0
Name: Marks, dtype: float64

In [27]:
df["Marks"] % 2

0    1
1    0
2    1
3    0
Name: Marks, dtype: int64

In [28]:
df

      Name  Age  Marks     city
0  Shivani   25     85    Delhi
1    Krish   30     90   Mumbai
2    Manav   35     95  Chennai
3    Aarav   40     80  Kolkata

In [29]:
df["Marks"] = df["Marks"] + 5
print(df)

      Name  Age  Marks     city
0  Shivani   25     90    Delhi
1    Krish   30     95   Mumbai
2    Manav   35    100  Chennai
3    Aarav   40     85  Kolkata

In [30]:
type(df["Marks"])

pandas.core.series.Series

In [31]:
df2 = pd.DataFrame({
    'Product': ['Laptop', 'Tablet', 'Smartphone', 'Desktop'],
    'Price': [1000, 500, 800, 1200],
    'Stock': [50, 100, 75, 30]
})

df2

      Product  Price  Stock
0      Laptop   1000     50
1      Tablet    500    100
2  Smartphone    800     75
3     Desktop   1200     30

In [33]:
df3 = pd.DataFrame([
    ["Laptop","Tablet","Smartphone","Desktop"],
    [ 1000, 500, 800, 1200],
    [ 50, 100, 75, 30]
]).index = ["Product" , "Price", "Stock"]

df3

['Product', 'Price', 'Stock']

In [34]:
df3 = pd.DataFrame(np.random.randn(4, 3), columns=['A', 'B', 'C'])
df3

          A         B         C
0 -0.242749  1.232546 -0.592241
1  0.180133 -0.034495 -1.859883
2 -0.513340 -2.571878 -1.017367
3 -0.636599 -2.161785 -1.833875

In [35]:
type(df3)

pandas.core.frame.DataFrame

In [36]:
type(df3["A"])

pandas.core.series.Series

In [ ]:
lel = [
    ["Alice", 28, "New York"],
    ["Bob", 34, "Los Angeles"],
    ["Charlie", 22, "Chicago"],
    ["David", 45, "Houston"]
]